<a href="https://colab.research.google.com/github/smallriver0316/python-datascience-study/blob/add-titanic-pivottable/hello_colab_notbook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [ ]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
# 二重括弧でsuvived columnを指定することで、出力結果もdataframeになる
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [ ]:
# unstack()で階層型インデックスとすることで、多次元性を表現
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [ ]:
# pivot_tableで同様に表現する
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [ ]:
# 多重ピボットテーブル
# pd.cut()で行に対する分類を加える
age = pd.cut(titanic['age'], [0, 20, 40, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (0, 20]   0.928571  1.000000  0.510638
       (20, 40]  0.977778  0.911111  0.478261
       (40, 80]  0.961538  0.846154  0.111111
male   (0, 20]   0.571429  0.526316  0.197368
       (20, 40]  0.500000  0.050847  0.143836
       (40, 80]  0.280000  0.095238  0.064516

In [ ]:
# pd.qcut()で列に対する分類を加える
# pd.qcut()の2番目の引数に指定した数字だけ自動分類される
# pivot_table()における指定では表示順にリストに詰める
fare = pd.qcut(titanic['fare'], 3)
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

fare            (-0.001, 8.662]            ... (26.0, 512.329]
class                     First     Third  ...          Second     Third
sex    age                                 ...
female (0, 20]              NaN  0.692308  ...        1.000000  0.111111
       (20, 40]             NaN  0.529412  ...        1.000000  0.250000
       (40, 80]             NaN  0.000000  ...        1.000000  0.000000
male   (0, 20]              NaN  0.162162  ...        0.666667  0.052632
       (20, 40]             0.0  0.135135  ...        0.000000  0.500000
       (40, 80]             NaN  0.074074  ...        0.000000       NaN

[6 rows x 8 columns]

In [ ]:
# aggfunc引数で扱うデータのと統計値の関係をマッピング
titanic.pivot_table(index='sex', columns='class', aggfunc={'survived': 'sum', 'fare': 'mean' })

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [ ]:
titanic.pivot_table('survived', index='sex', columns='class', margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [ ]:
titanic.pivot_table('survived', index='sex', columns='class', margins=True, margins_name='All Categories')

class              First    Second     Third  All Categories
sex
female          0.968085  0.921053  0.500000        0.742038
male            0.368852  0.157407  0.135447        0.188908
All Categories  0.629630  0.472826  0.242363        0.383838